Parrychan1219/ESP32S3-Server-Health-Monitor/src/main.cpp
#include <Arduino.h>
/*
 * ESP32-S3 Server Pinger
 * ----------------------
 *  - Pings the LAN server + the internet every cycle
 *  - HTTPS health-checks a list of subdomains every cycle
 *  - Timestamps + durations for WiFi/internet outages
 *  - Detects power outages across reboots via an NVS heartbeat
 *  - Telegram alerts (queued while offline, flushed on recovery)
 *  - Telegram commands: /status /server /check /reboot
 *  - /server relays a status text the LAN server regenerates every minute
 *  - Relays iMac failover on/off reports (POST /failover, LAN) to Telegram
 *  - Daily digest, OTA updates
 */

#include <WiFi.h>
#include <ESP32Ping.h>
#include <HTTPClient.h>
#include <WebServer.h>
#include <WiFiClientSecure.h>
#include <Preferences.h>
#include <esp_system.h>
#include <time.h>
#include "secrets.h"

// ---------------------------------------------------------------- features
#define ENABLE_OTA          1   // flash over WiFi instead of unplugging the board
#define ENABLE_TG_COMMANDS  1   // reply to /status /check /reboot in Telegram
#define ENABLE_DAILY_DIGEST 1
#define ENABLE_FAILOVER_API 1   // accept failover on/off reports from the iMac

#if ENABLE_OTA
  #include <ArduinoOTA.h>
#endif

// ---------------------------------------------------------------- credentials
const char* ssid = WIFI_SSID;
const char* pw   = WIFI_PASSWORD;

const String tg_token = TELEGRAM_BOT_TOKEN;
const String chatID   = TELEGRAM_CHAT_ID;

// ---------------------------------------------------------------- network
IPAddress local_IP(192, 168, 1, 220);
IPAddress gateway(192, 168, 1, 1);
IPAddress subnet(255, 255, 255, 0);
IPAddress primaryDNS(8, 8, 8, 8);
IPAddress secondaryDNS(1, 1, 1, 1);

IPAddress server_IP(192, 168, 1, 200);

// Server details for /server. Plain HTTP on the LAN, by IP: this board resolves
// through public DNS on purpose (so the server being down cannot blind it), and
// the server's names only resolve to its LAN address through the server's own
// resolver. nginx answers this one path for LAN clients only.
const char*    SERVER_STATUS_URL        = "http://192.168.1.200/pinger/status.txt";
const uint16_t SERVER_STATUS_TIMEOUT_MS = 5000;
const uint16_t SERVER_STATUS_MAX_CHARS  = 1500;   // Telegram GET URL stays sane
// The iMac that stands in for the server on 443 (mhs-failover). It reports each
// takeover and hand-back with POST /failover?state=on|off; only it may.
// .254 is the shared 443 address, which it holds while failed over.
IPAddress failover_IP(192, 168, 1, 202);
IPAddress failover_VIP(192, 168, 1, 254);

IPAddress internet_IP1(1, 1, 1, 1);
IPAddress internet_IP2(8, 8, 8, 8);

// ---------------------------------------------------------------- SITES
// The list itself lives in sites.h - that is the only file you edit to add,
// remove or comment out a site. Each SITE(...) line there expands into one
// entry of this array.
struct SiteCfg { const char* name; const char* url; };

const SiteCfg SITES[] = {
  #define SITE(name, url) { name, url },
  #include "sites.h"
  #undef SITE
};
const uint8_t SITE_COUNT = sizeof(SITES) / sizeof(SITES[0]);

// ---------------------------------------------------------------- tuning
const unsigned long PING_INTERVAL   = 60000;  // main check cycle: 1 minute
const uint16_t  SITE_TIMEOUT_MS     = 8000;   // per-site HTTP timeout
const uint16_t  SITE_CONNECT_MS     = 6000;   // per-site TCP/TLS connect timeout
const uint8_t   SITE_FAIL_STRIKES   = 2;      // consecutive fails before "DOWN"
const uint8_t   SITE_OK_STRIKES     = 1;      // consecutive OKs before "UP"
const uint8_t   SERVER_FAIL_STRIKES = 3;      // unchanged from before

const unsigned long HEARTBEAT_MS    = 60000;  // NVS "still alive" write interval
const unsigned long WIFI_RETRY_MS   = 15000;  // reconnect attempt spacing
const unsigned long REBOOT_AFTER_MS = 900000; // reboot if WiFi dead 15 min
const unsigned long TG_POLL_MS      = 5000;   // Telegram command poll interval

#define TZ_INFO       "HKT-8"                 // POSIX TZ: Hong Kong, UTC+8, no DST
#define DIGEST_HOUR   9                       // daily report at 09:00 local
#define MIN_EPOCH     1700000000UL            // anything below this = clock unsynced

// ---------------------------------------------------------------- state
Preferences prefs;

enum DeviceState {
  WIFI_DOWN,
  NO_INTERNET_WIFI_OK,
  SERVER_UP,
  SERVER_MISSED_LATEST,
  SERVER_DEAD_INTERNET_UP,
  SITE_DOWN_SERVER_UP,
  WIFI_CONNECTED_IDLE,
  OTA_ACTIVE
};
DeviceState currentState = WIFI_DOWN;

struct SiteState {
  bool     up;
  uint8_t  fails;
  uint8_t  oks;
  time_t   firstFailAt;
  uint32_t firstFailMs;
  uint32_t checks;
  uint32_t okChecks;
  int      lastCode;
  uint32_t lastMs;
};
SiteState siteState[SITE_COUNT];

unsigned long lastPingTime      = 0;
unsigned long lastHeartbeatMs   = 0;
unsigned long lastWifiTry       = 0;
unsigned long lastTgPoll        = 0;
unsigned long flashTimer        = 0;
bool          flashState        = false;
bool          firstCycleDone    = false;

// failover reports: written by the web task, acted on by loop()
volatile uint8_t failoverPending = 0;   // 0 none, 1 went on, 2 went off
volatile bool    failoverActive  = false;
volatile time_t  failoverSince   = 0;

int      failedServerPings = 0;
bool     serverUp          = true;
time_t   serverDownAt      = 0;
uint32_t serverDownAtMs    = 0;

// connectivity outage bookkeeping
bool     netDown        = false;
bool     netDownMsValid = false;
time_t   netDownAt      = 0;
uint32_t netDownAtMs    = 0;
String   netDownReason  = "";
uint32_t outageCount    = 0;
uint32_t outageTotalSec = 0;

// boot info
esp_reset_reason_t bootReason;
uint32_t bootCount      = 0;
time_t   lastSeenAtBoot = 0;
time_t   pendingOutage  = 0;
int      lastDigestDay  = -1;
bool     bootReportPending = true;
bool     otaStarted        = false;
volatile bool otaInProgress   = false;

// S3 built-in RGB LED
#ifndef RGB_BUILTIN
#define RGB_BUILTIN 48
#endif
uint32_t lastRGBWritten = 0xFFFFFFFF;

// ================================================================ helpers

