Parrychan1219/ESP32S3-Server-Health-Monitor/src/main.cpp
time_t nowEpoch() { return time(nullptr); }
bool   clockOK()  { return nowEpoch() > (time_t)MIN_EPOCH; }

String fmtTime(time_t t) {
  if (t < (time_t)MIN_EPOCH) return "unknown (clock not synced)";
  struct tm ti;
  localtime_r(&t, &ti);
  char buf[32];
  strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S", &ti);
  return String(buf);
}

String fmtDur(uint32_t sec) {
  if (sec == 0) return "under a second";
  uint32_t d = sec / 86400; sec %= 86400;
  uint32_t h = sec / 3600;  sec %= 3600;
  uint32_t m = sec / 60;
  uint32_t s = sec % 60;
  String o;
  if (d)      o += String(d) + "d ";
  if (h || d) o += String(h) + "h ";
  if (m || h || d) o += String(m) + "m ";
  o += String(s) + "s";
  return o;
}

String urlEncode(const String &in) {
  static const char* hex = "0123456789ABCDEF";
  String out;
  out.reserve(in.length() * 3);
  for (size_t i = 0; i < in.length(); i++) {
    uint8_t c = (uint8_t)in[i];
    if (isalnum(c) || c == '-' || c == '_' || c == '.' || c == '~') {
      out += (char)c;
    } else {
      out += '%';
      out += hex[(c >> 4) & 0x0F];
      out += hex[c & 0x0F];
    }
  }
  return out;
}

const char* resetReasonStr(esp_reset_reason_t r) {
  switch (r) {
    case ESP_RST_POWERON:   return "power-on (cold boot / mains restored)";
    case ESP_RST_BROWNOUT:  return "brownout (supply voltage dipped)";
    case ESP_RST_EXT:       return "external reset pin";
    case ESP_RST_SW:        return "software restart";
    case ESP_RST_PANIC:     return "crash / panic";
    case ESP_RST_INT_WDT:   return "interrupt watchdog";
    case ESP_RST_TASK_WDT:  return "task watchdog";
    case ESP_RST_WDT:       return "watchdog";
    case ESP_RST_DEEPSLEEP: return "deep sleep wake";
    default:                return "unknown";
  }
}

// ================================================================ LEDs

void writeRGB(uint8_t r, uint8_t g, uint8_t b) {
  uint32_t v = ((uint32_t)r << 16) | ((uint32_t)g << 8) | b;
  if (v == lastRGBWritten) return;
  lastRGBWritten = v;
  neopixelWrite(RGB_BUILTIN, r, g, b);
}

void setLED(uint8_t r, uint8_t g, uint8_t b) {
  // Scale down heavily to absolute single digits because the hardware curve is clapped
  uint8_t dim_r = r > 0 ? 8 : 0;
  uint8_t dim_g = g > 0 ? 8 : 0;
  uint8_t dim_b = b > 0 ? 8 : 0;

  if (r == 128 && b == 128) { dim_r = 4; dim_b = 4; }   // purple
  if (r == 255 && g == 255) { dim_r = 4; dim_g = 4; }   // yellow

  if (currentState == SERVER_DEAD_INTERNET_UP) {
    writeRGB(r, g, b);          // full brightness, this one matters
  } else {
    writeRGB(dim_r, dim_g, dim_b);
  }
}

void flash(uint8_t r, uint8_t g, uint8_t b, uint16_t period) {
  if (millis() - flashTimer > period) {
    flashTimer = millis();
    flashState = !flashState;
  }
  if (flashState) setLED(r, g, b);
  else            setLED(0, 0, 0);
}

void handleLEDs() {
  switch (currentState) {
    case WIFI_DOWN:               setLED(255, 0, 0);          break; // red
    case WIFI_CONNECTED_IDLE:     setLED(128, 0, 128);        break; // purple
    case NO_INTERNET_WIFI_OK:     flash(128, 0, 128, 500);    break; // purple flash
    case SERVER_UP:               setLED(0, 255, 0);          break; // green
    case SERVER_MISSED_LATEST:    setLED(255, 255, 0);        break; // yellow
    case SERVER_DEAD_INTERNET_UP: flash(255, 0, 0, 500);      break; // red flash
    case SITE_DOWN_SERVER_UP:     flash(0, 0, 255, 800);      break; // blue flash
    case OTA_ACTIVE:              flash(0, 0, 255, 120);      break; // fast blue = flashing
  }
}

// ================================================================ Telegram

bool sendTelegramNow(const String &message) {
  if (WiFi.status() != WL_CONNECTED) return false;

  WiFiClientSecure client;
  client.setInsecure();                 // ignore SSL certs

  HTTPClient http;
  http.setConnectTimeout(8000);
  http.setTimeout(10000);

  String url = "https://api.telegram.org/bot" + tg_token +
               "/sendMessage?chat_id=" + chatID +
               "&disable_web_page_preview=true&text=" + urlEncode(message);

  if (!http.begin(client, url)) {
    Serial.println("[-] Unable to initialize secure client.");
    return false;
  }
  int httpCode = http.GET();
  http.end();

  if (httpCode == 200) {
    Serial.println("[+] Telegram delivered.");
    return true;
  }
  Serial.printf("[-] Telegram failed, code %d\n", httpCode);
  return false;
}

// Ring buffer so alerts raised while offline are not lost.
#define ALERT_QUEUE_SIZE 12
String  alertQueue[ALERT_QUEUE_SIZE];
uint8_t qHead = 0, qCount = 0;

void notify(const String &msg) {
  Serial.println("---- TELEGRAM ----\n" + msg + "\n------------------");
  if (sendTelegramNow(msg)) return;

  if (qCount == ALERT_QUEUE_SIZE) {          // drop the oldest
    qHead = (qHead + 1) % ALERT_QUEUE_SIZE;
    qCount--;
  }
  alertQueue[(qHead + qCount) % ALERT_QUEUE_SIZE] = msg;
  qCount++;
  Serial.printf("[*] Queued alert (%u pending).\n", qCount);
}

void flushAlertQueue() {
  while (qCount > 0) {
    if (!sendTelegramNow(alertQueue[qHead])) return;   // still offline, try later
    alertQueue[qHead] = "";
    qHead = (qHead + 1) % ALERT_QUEUE_SIZE;
    qCount--;
    delay(250);                                        // be nice to the API
  }
}

// ================================================================ status text

String buildStatus() {
  String s;
  s += "Time:    " + fmtTime(nowEpoch()) + "\n";
  s += "Uptime:  " + fmtDur(millis() / 1000) + "\n";
  s += "Boots:   " + String(bootCount) + " (last: " + resetReasonStr(bootReason) + ")\n";
  s += "Outages: " + String(outageCount) + " since boot, " + fmtDur(outageTotalSec) + " total\n";
  s += "WiFi:    " + String(WiFi.RSSI()) + " dBm, IP " + WiFi.localIP().toString() + "\n";
  s += "Heap:    " + String(ESP.getFreeHeap() / 1024) + " kB free\n\n";

  s += "Server " + server_IP.toString() + ": " + String(serverUp ? "UP" : "DOWN");
  if (!serverUp) s += " since " + fmtTime(serverDownAt);
  if (failoverActive) s += "\nFailover: iMac is answering 443 since " + fmtTime(failoverSince);
  s += "\n\nSites:\n";

