Parrychan1219/ESP32S3-Server-Health-Monitor/src/main.cpp
  for (uint8_t i = 0; i < SITE_COUNT; i++) {
    SiteState &st = siteState[i];
    s += String(st.up ? "  [UP]   " : "  [DOWN] ") + SITES[i].name;
    if (st.checks) {
      uint32_t pct = (st.okChecks * 1000UL) / st.checks;   // one decimal
      s += "  " + String(pct / 10) + "." + String(pct % 10) + "%";
    }
    if (st.lastCode > 0) s += "  HTTP " + String(st.lastCode) + " / " + String(st.lastMs) + "ms";
    else                 s += "  no response";
    if (!st.up) s += "\n          down since " + fmtTime(st.firstFailAt);
    s += "\n";
  }
  return s;
}

// Fetch the server's own status text. Returns a message either way, so the
// caller can hand it straight to Telegram.
String fetchServerStatus() {
  if (WiFi.status() != WL_CONNECTED) return "Cannot reach the server: WiFi is down.";

  WiFiClient client;
  HTTPClient http;
  http.setConnectTimeout(SERVER_STATUS_TIMEOUT_MS);
  http.setTimeout(SERVER_STATUS_TIMEOUT_MS);
  http.setUserAgent("ESP32-Pinger/2.0");

  uint32_t t0 = millis();
  if (!http.begin(client, SERVER_STATUS_URL)) return "Cannot reach the server: HTTP client failed to start.";
  int code = http.GET();
  String body = (code == 200) ? http.getString() : "";
  http.end();
  uint32_t ms = millis() - t0;
  Serial.printf("[%s] server status -> code %d (%lu ms)\n", code == 200 ? "+" : "-", code, (unsigned long)ms);

  if (code != 200) {
    String why = (code > 0) ? ("HTTP " + String(code)) : "no response / connection refused";
    return "SERVER DETAILS unavailable (" + why + " after " + String(ms) + " ms)\n\n"
           "The LAN server (" + server_IP.toString() + ") is " + String(serverUp ? "answering pings" : "NOT answering pings") +
           ". If it is up, check the server-status timer and the nginx LAN vhost on it.";
  }
  body.trim();
  if (body.length() > SERVER_STATUS_MAX_CHARS) body = body.substring(0, SERVER_STATUS_MAX_CHARS) + "\n[...]";
  return "SERVER DETAILS (fetched in " + String(ms) + " ms)\n\n" + body;
}

// ================================================================ checks

bool checkInternet() {
  return Ping.ping(internet_IP1, 1) || Ping.ping(internet_IP2, 1);
}

// Returns true if the site answered with a status below 500.
bool httpCheck(const char* url, int &code, uint32_t &elapsedMs) {
  WiFiClientSecure client;
  client.setInsecure();
  client.setTimeout(SITE_TIMEOUT_MS / 1000);

  HTTPClient http;
  http.setConnectTimeout(SITE_CONNECT_MS);
  http.setTimeout(SITE_TIMEOUT_MS);
  http.setUserAgent("ESP32-Pinger/2.0");
  http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
  http.setRedirectLimit(3);

  uint32_t t0 = millis();
  if (!http.begin(client, url)) {
    code = 0;
    elapsedMs = millis() - t0;
    return false;
  }
  code = http.GET();
  elapsedMs = millis() - t0;
  http.end();

  return (code > 0 && code < 500);
}

// ================================================================ outage tracking

void beginNetOutage(const String &reason) {
  if (netDown) return;
  netDown        = true;
  netDownMsValid = true;
  netDownAt      = nowEpoch();
  netDownAtMs    = millis();
  netDownReason  = reason;
  outageCount++;

  // Persist so a reboot mid-outage does not lose the start time.
  prefs.putULong("outSince", clockOK() ? (uint32_t)netDownAt : 0);

  Serial.println("[!] Connectivity lost: " + reason + " at " + fmtTime(netDownAt));
}

void endNetOutage() {
  if (!netDown) return;

  uint32_t dur = 0;
  if (netDownMsValid)                          dur = (millis() - netDownAtMs) / 1000;
  else if (clockOK() && netDownAt > (time_t)MIN_EPOCH) dur = (uint32_t)(nowEpoch() - netDownAt);

  netDown = false;
  outageTotalSec += dur;
  prefs.putULong("outSince", 0);

  String m  = "INTERNET RESTORED\n\n";
         m += "Went down:  " + fmtTime(netDownAt) + "\n";
         m += "Came back:  " + fmtTime(nowEpoch()) + "\n";
         m += "Offline for: " + fmtDur(dur) + "\n";
         m += "Cause seen: " + netDownReason + "\n\n";
         m += "Connection is working properly again.";
  notify(m);
}

void heartbeat() {
  if (millis() - lastHeartbeatMs < HEARTBEAT_MS) return;
  lastHeartbeatMs = millis();
  if (clockOK()) prefs.putULong("lastSeen", (uint32_t)nowEpoch());
}

// ================================================================ boot report

void sendBootReport() {
  bool powerLoss = (bootReason == ESP_RST_POWERON || bootReason == ESP_RST_BROWNOUT);

  // Back-compute when this boot actually happened. The router often takes
  // minutes longer than the ESP32 to come back after a power cut, so "now"
  // would overstate the outage.
  time_t bootedAt = clockOK() ? (time_t)(nowEpoch() - (millis() / 1000)) : 0;

  String m  = "PINGER ONLINE\n\n";
         m += "Boot #" + String(bootCount) + "\n";
         m += "Reset reason: " + String(resetReasonStr(bootReason)) + "\n";
         m += "Time now: " + fmtTime(nowEpoch()) + "\n";

  if (powerLoss) {
    if (lastSeenAtBoot > (time_t)MIN_EPOCH && bootedAt > lastSeenAtBoot) {
      uint32_t gap = (uint32_t)(bootedAt - lastSeenAtBoot);
      m += "\nPOWER OUTAGE DETECTED\n";
      m += "Last seen alive: " + fmtTime(lastSeenAtBoot) + "\n";
      m += "Power restored:  " + fmtTime(bootedAt) + "\n";
      m += "No power for:    ~" + fmtDur(gap) +
           "  (+/- " + String(HEARTBEAT_MS / 1000) + "s)\n";
      m += "\nBoard is powered and monitoring again.";
    } else {
      m += "\nNo previous heartbeat stored - treating this as a fresh install.";
    }
  } else if (pendingOutage > (time_t)MIN_EPOCH) {
    m += "\nRebooted while the connection was down (outage began " +
         fmtTime(pendingOutage) + ").";
  }

  m += "\n\nWatching " + String(SITE_COUNT) + " site(s) + server " + server_IP.toString() +
       ", every " + String(PING_INTERVAL / 1000) + "s.";
  notify(m);
}

// ================================================================ Telegram commands

#if ENABLE_TG_COMMANDS
long tgOffset = 0;

// Telegram keeps handing back an update until getUpdates is called with an
// offset past it; an unconfirmed one sits in the queue for ~24h. That makes a
// reboot command self-repeating: reboot, poll, get the same /reboot, reboot.
// The offset therefore has to survive the restart (NVS) *and* be confirmed
// with Telegram before the board goes down (tgConfirmOffset).
void saveTgOffset() {
  prefs.putULong("tgOffset", (uint32_t)tgOffset);
}

void tgConfirmOffset() {
  if (!tgOffset || WiFi.status() != WL_CONNECTED) return;

  WiFiClientSecure client;
  client.setInsecure();
  HTTPClient http;
  http.setConnectTimeout(6000);
  http.setTimeout(8000);

  String url = "https://api.telegram.org/bot" + tg_token +
               "/getUpdates?timeout=0&limit=1&offset=" + String(tgOffset);
  if (!http.begin(client, url)) return;
  http.GET();
  http.end();
}

String helpText() {
  return
    "Server Pinger - available commands\n"
    "\n"
    "/status\n"
    "    Current state: uptime, boot count, outage totals, per-site\n"
    "    availability, WiFi signal and free heap.\n"
    "\n"
    "/server\n"
    "    Details from the server itself: uptime, load, temperature,\n"
    "    memory, disks, RAID, containers, failed services.\n"
    "\n"
    "/check\n"
    "    Run a check cycle immediately instead of waiting for the\n"
    "    next one, which can be up to a minute away.\n"
    "\n"
    "/reboot\n"
    "    Restart the board. It reports back once it is up again.\n"
    "\n"
    "/help\n"
    "    This message.\n"
    "\n"
    "Alerts are sent on their own when a site or the server goes down\n"
    "or recovers, when the internet drops, after a power cut, and when\n"
    "the iMac takes over or hands back port 443.";
}

void handleCommand(const String &cmd) {
  Serial.println("[*] Command: " + cmd);

  if (cmd.startsWith("/status") || cmd.startsWith("/uptime")) {
    notify("STATUS\n\n" + buildStatus());
  } else if (cmd.startsWith("/server")) {
    notify(fetchServerStatus());
  } else if (cmd.startsWith("/check")) {
    notify("Running a check cycle now...");
    lastPingTime = millis() - PING_INTERVAL; // force the next loop() to run one
  } else if (cmd.startsWith("/reboot")) {
    notify("Rebooting on request.");
    tgConfirmOffset();   // or Telegram replays this command into the next boot
    delay(500);
    ESP.restart();
  } else if (cmd.startsWith("/help") || cmd.startsWith("/start")) {
    // /start is what Telegram sends when the chat is first opened.
    notify(helpText());
  } else {
    // Anything else, slash-prefixed or not, is not something we know.
    String shown = cmd;
    if (shown.length() > 40) shown = shown.substring(0, 40) + "...";
    notify("Not a command: \"" + shown + "\"\n\nSend /help to see what I understand.");
  }
}

void handleTelegramUpdates(const String &body) {
  int idx = 0;
  while (true) {
    int u = body.indexOf("\"update_id\":", idx);
    if (u < 0) break;

    int numEnd = body.indexOf(',', u + 12);
    if (numEnd < 0) break;
    long id = body.substring(u + 12, numEnd).toInt();
    if (id >= tgOffset) { tgOffset = id + 1; saveTgOffset(); }

    int next  = body.indexOf("\"update_id\":", u + 12);
    int limit = (next < 0) ? body.length() : next;
    String chunk = body.substring(u, limit);

    // only obey messages from the configured chat
    if (chunk.indexOf("\"id\":" + chatID) >= 0) {
      int t = chunk.indexOf("\"text\":\"");
      if (t >= 0) {
        int e = chunk.indexOf('"', t + 8);
        if (e > t) {
          String txt = chunk.substring(t + 8, e);
          txt.trim();
          txt.toLowerCase();
          handleCommand(txt);
        }
      } else {
        // A sticker, photo or voice note. allowed_updates keeps this to
        // real messages, so there is nothing else this could be.
        Serial.println("[*] Non-text message from owner");
        notify("Not a command: that message has no text.\n\nSend /help to see what I understand.");
      }
    }

    if (next < 0) break;
    idx = limit;
  }
}

