Parrychan1219/ESP32S3-Server-Health-Monitor/src/main.cpp
void pollTelegram() {
  if (millis() - lastTgPoll < TG_POLL_MS) return;
  lastTgPoll = millis();

  WiFiClientSecure client;
  client.setInsecure();
  HTTPClient http;
  http.setConnectTimeout(6000);
  http.setTimeout(8000);

  String url = "https://api.telegram.org/bot" + tg_token +
               "/getUpdates?timeout=0&limit=5"
               "&allowed_updates=%5B%22message%22%5D";
  if (tgOffset) url += "&offset=" + String(tgOffset);

  if (!http.begin(client, url)) return;
  int code = http.GET();
  if (code == 200) {
    String body = http.getString();
    http.end();
    handleTelegramUpdates(body);
  } else {
    http.end();
  }
}
#endif  // ENABLE_TG_COMMANDS

// ================================================================ daily digest

#if ENABLE_DAILY_DIGEST
void maybeDailyDigest() {
  if (!clockOK()) return;
  time_t t = nowEpoch();
  struct tm ti;
  localtime_r(&t, &ti);

  if (lastDigestDay < 0) {                    // first sync after boot
    lastDigestDay = (ti.tm_hour >= DIGEST_HOUR) ? ti.tm_yday : -2;
    return;
  }
  if (ti.tm_hour == DIGEST_HOUR && ti.tm_yday != lastDigestDay) {
    lastDigestDay = ti.tm_yday;
    notify("DAILY REPORT\n\n" + buildStatus());
  }
}
#endif

// ================================================================ WiFi

void handleWiFi() {
  if (WiFi.status() == WL_CONNECTED) return;

  currentState = WIFI_DOWN;
  beginNetOutage("WiFi lost association with \"" + String(ssid) + "\"");

  if (millis() - lastWifiTry > WIFI_RETRY_MS) {
    lastWifiTry = millis();
    Serial.println("[*] WiFi reconnect attempt...");
    WiFi.disconnect();
    WiFi.begin(ssid, pw);
  }

  if (netDownMsValid && millis() - netDownAtMs > REBOOT_AFTER_MS) {
    Serial.println("[!] WiFi down too long. Rebooting.");
    if (clockOK()) prefs.putULong("outSince", (uint32_t)netDownAt);
    delay(200);
    ESP.restart();
  }
}

void syncTime(uint16_t waitMs) {
  configTzTime(TZ_INFO, "pool.ntp.org", "time.google.com", "time.cloudflare.com");
  uint32_t t0 = millis();
  while (!clockOK() && millis() - t0 < waitMs) delay(200);
  Serial.println(clockOK() ? "[+] Clock synced: " + fmtTime(nowEpoch())
                           : "[-] NTP sync failed.");
}

// ================================================================ check cycle

void checkSites(bool &anySiteDown) {
  anySiteDown = false;

  for (uint8_t i = 0; i < SITE_COUNT; i++) {
    SiteState &st = siteState[i];
    int code = 0;
    uint32_t ms = 0;

    bool ok = httpCheck(SITES[i].url, code, ms);
    st.checks++;
    st.lastCode = code;
    st.lastMs   = ms;
    if (ok) st.okChecks++;

    Serial.printf("[%s] %s -> code %d (%lu ms)\n",
                  ok ? "+" : "-", SITES[i].name, code, (unsigned long)ms);

    if (ok) {
      st.fails = 0;
      st.oks++;
      if (!st.up && st.oks >= SITE_OK_STRIKES) {
        st.up = true;
        uint32_t dur = st.firstFailMs ? (millis() - st.firstFailMs) / 1000 : 0;
        String m  = "SITE UP: " + String(SITES[i].name) + "\n\n";
               m += String(SITES[i].url) + "\n";
               m += "Recovered: " + fmtTime(nowEpoch()) + "\n";
               m += "Went down: " + fmtTime(st.firstFailAt) + "\n";
               m += "Down for:  " + fmtDur(dur) + "\n";
               m += "Now answering HTTP " + String(code) + " in " + String(ms) + " ms.";
        notify(m);
      }
    } else {
      st.oks = 0;
      st.fails++;
      if (st.fails == 1) {                    // remember when it first misbehaved
        st.firstFailAt = nowEpoch();
        st.firstFailMs = millis();
      }
      if (st.up && st.fails >= SITE_FAIL_STRIKES) {
        st.up = false;
        String why = (code > 0) ? ("HTTP " + String(code))
                                : "no response / connection refused / TLS failure";
        String m  = "SITE DOWN: " + String(SITES[i].name) + "\n\n";
               m += String(SITES[i].url) + "\n";
               m += "First failed: " + fmtTime(st.firstFailAt) + "\n";
               m += "Confirmed:    " + fmtTime(nowEpoch()) + " after " +
                    String(st.fails) + " tries\n";
               m += "Reason: " + why;
        notify(m);
      }
    }

    if (!st.up) anySiteDown = true;
    delay(50);                                 // let the TLS context tear down
  }
}

void runCheckCycle() {
  Serial.println("\n[*] ===== check cycle =====");

  Serial.println("[*] Pinging Internet...");
  if (!checkInternet()) {
    beginNetOutage("WiFi associated but 1.1.1.1 and 8.8.8.8 both unreachable");
    currentState = NO_INTERNET_WIFI_OK;
    return;
  }
  endNetOutage();                              // sends the recovery message if needed

  if (!clockOK()) syncTime(5000);

  // ---- LAN server ----
  Serial.println("[*] Pinging Server...");
  if (Ping.ping(server_IP, 1)) {
    if (failedServerPings >= SERVER_FAIL_STRIKES) {
      uint32_t dur = serverDownAtMs ? (millis() - serverDownAtMs) / 1000 : 0;
      String m  = "SERVER UP: mainhomeserver\n\n";
             m += "Recovered: " + fmtTime(nowEpoch()) + "\n";
             m += "Went down: " + fmtTime(serverDownAt) + "\n";
             m += "Down for:  " + fmtDur(dur);
      notify(m);
    }
    failedServerPings = 0;
    serverUp = true;
    currentState = SERVER_UP;
    Serial.println("[+] Server is alive.");
  } else {
    failedServerPings++;
    Serial.printf("[-] Server missed ping. Strike %d\n", failedServerPings);
    if (failedServerPings == 1) {
      serverDownAt   = nowEpoch();
      serverDownAtMs = millis();
    }
    if (failedServerPings < SERVER_FAIL_STRIKES) {
      currentState = SERVER_MISSED_LATEST;
    } else {
      currentState = SERVER_DEAD_INTERNET_UP;
      if (failedServerPings == SERVER_FAIL_STRIKES) {
        serverUp = false;
        String m  = "SERVER DOWN: mainhomeserver\n\n";
               m += String(SERVER_FAIL_STRIKES) + " consecutive pings missed.\n";
               m += "First miss: " + fmtTime(serverDownAt) + "\n";
               m += "Confirmed:  " + fmtTime(nowEpoch());
        notify(m);
      }
    }
  }

