Parrychan1219/ESP32S3-Server-Health-Monitor/src/main.cpp
  // ---- public sites ----
  bool anySiteDown = false;
  if (SITE_COUNT) {
    Serial.println("[*] Checking sites...");
    checkSites(anySiteDown);
  }

  // site trouble only colours the LED when the LAN server itself looks fine
  if (anySiteDown && currentState == SERVER_UP) currentState = SITE_DOWN_SERVER_UP;

  firstCycleDone = true;
  Serial.println("[*] ===== cycle done =====\n");
}

// ================================================================ failover reports

#if ENABLE_FAILOVER_API
// The iMac (mhs-failover) posts here when it takes 192.168.1.254 -- the router's
// 443 target -- and when it gives it back. Like OTA, this is served from its
// own task on core 0, because loop() can sit in check timeouts for a minute.
// The handler only records the change; loop() sends the Telegram message, so
// two TLS clients never run at once.
WebServer web(80);

void handleFailover() {
  IPAddress from = web.client().remoteIP();
  if (from != failover_IP && from != failover_VIP) {
    web.send(403, "text/plain", "forbidden\n");
    return;
  }
  if (web.method() != HTTP_POST) {
    web.send(405, "text/plain", "POST only\n");
    return;
  }
  String st = web.arg("state");
  if (st == "on") {
    if (!failoverActive) { failoverActive = true; failoverSince = nowEpoch(); failoverPending = 1; }
  } else if (st == "off") {
    if (failoverActive)  { failoverActive = false; failoverPending = 2; }
  } else {
    web.send(400, "text/plain", "state must be on or off\n");
    return;
  }
  web.send(200, "text/plain", "ok\n");
}

void webTask(void* param) {
  for (;;) {
    web.handleClient();
    vTaskDelay(pdMS_TO_TICKS(10));
  }
}

void startWeb() {
  static bool started = false;
  if (started) return;
  started = true;
  web.on("/failover", handleFailover);
  web.onNotFound([]() { web.send(404, "text/plain", "not found\n"); });
  web.begin();
  xTaskCreatePinnedToCore(webTask, "webTask", 6144, nullptr, 1, nullptr, 0);
  Serial.println("[+] Failover endpoint ready: http://" + WiFi.localIP().toString() + "/failover");
}

void handleFailoverPending() {
  uint8_t p = failoverPending;
  if (!p) return;
  failoverPending = 0;
  if (p == 1) {
    notify("FAILOVER ON: the iMac is answering 443\n\n"
           "Since: " + fmtTime(failoverSince) + "\n"
           "mainhomeserver failed its web check and gave up 192.168.1.254, so visitors\n"
           "to the grey-clouded sites now get the \"temporarily down\" page from the iMac.\n"
           "dllmch.org, www, tools and mc get it from the Cloudflare Worker.");
  } else {
    notify("FAILOVER OFF: 443 is back on mainhomeserver\n\n"
           "The iMac handed 192.168.1.254 back at " + fmtTime(nowEpoch()) + ".\n"
           "Failed over since " + fmtTime(failoverSince) + ".");
  }
}
#endif  // ENABLE_FAILOVER_API

// ================================================================ boot tasks

#if ENABLE_OTA
// loop() can block for 20-30s while HTTP checks time out - long enough for
// espota.py to give up waiting on the handshake, and that is exactly when you
// want to push a fix. So OTA gets its own task on the other core and is
// serviced every 10ms no matter what the main loop is stuck on.
void otaTask(void* param) {
  for (;;) {
    ArduinoOTA.handle();
    vTaskDelay(pdMS_TO_TICKS(10));
  }
}
#endif

void startOTA() {
#if ENABLE_OTA
  if (otaStarted) return;
  otaStarted = true;

  ArduinoOTA.setHostname("esp32-pinger");
  #ifdef OTA_PASSWORD
    ArduinoOTA.setPassword(OTA_PASSWORD);
  #endif

  ArduinoOTA.onStart([]() {
    otaInProgress = true;
    currentState  = OTA_ACTIVE;
    Serial.println("\n[*] OTA update starting...");
  });
  ArduinoOTA.onProgress([](unsigned int done, unsigned int total) {
    static uint8_t lastPct = 255;
    uint8_t pct = total ? (done * 100) / total : 0;
    if (pct != lastPct && pct % 10 == 0) {
      lastPct = pct;
      Serial.printf("[*] OTA %u%%\n", pct);
    }
  });
  ArduinoOTA.onEnd([]() {
    Serial.println("[+] OTA complete, rebooting.");
    otaInProgress = false;
  });
  ArduinoOTA.onError([](ota_error_t err) {
    otaInProgress = false;
    Serial.printf("[-] OTA failed, error %u. Old firmware kept.\n", err);
  });

  // 1s (the default) is not enough slack for the first chunk to land.
  ArduinoOTA.setTimeout(15000);

  ArduinoOTA.begin();

  // core 0: the Arduino loop lives on core 1, so a blocked loop cannot stall this
  xTaskCreatePinnedToCore(otaTask, "otaTask", 8192, nullptr, 1, nullptr, 0);

  Serial.println("[+] OTA ready: esp32-pinger.local / " + WiFi.localIP().toString() + ":3232");
#endif
}

// Deferred until we have both a connection and a synced clock, so a mains
// outage that also took the router down still gets reported once it returns.
void doBootReportIfPending() {
  if (!bootReportPending) return;
  if (WiFi.status() != WL_CONNECTED) return;
  if (!clockOK()) { syncTime(4000); if (!clockOK()) return; }

  bootReportPending = false;
  sendBootReport();

  // A power loss is already covered by the boot report; only resume a
  // pending outage record when this was a soft reset.
  if (bootReason == ESP_RST_POWERON || bootReason == ESP_RST_BROWNOUT) {
    prefs.putULong("outSince", 0);
  } else if (pendingOutage > (time_t)MIN_EPOCH) {
    netDown        = true;
    netDownMsValid = false;
    netDownAt      = pendingOutage;
    netDownReason  = "device rebooted during the outage";
    outageCount++;
  }
}

// ================================================================ setup / loop

void setup() {
  Serial.begin(115200);
  delay(500);

  bootReason = esp_reset_reason();

  prefs.begin("pinger", false);
  bootCount      = prefs.getUInt("boots", 0) + 1;
  lastSeenAtBoot = (time_t)prefs.getULong("lastSeen", 0);
  pendingOutage  = (time_t)prefs.getULong("outSince", 0);
  prefs.putUInt("boots", bootCount);
#if ENABLE_TG_COMMANDS
  tgOffset = (long)prefs.getULong("tgOffset", 0);
#endif

  Serial.printf("\n[*] Boot #%lu, reason: %s\n",
                (unsigned long)bootCount, resetReasonStr(bootReason));

