Parrychan1219/ESP32S3-Server-Health-Monitor/src/main.cpp
  for (uint8_t i = 0; i < SITE_COUNT; i++) {
    siteState[i] = { true, 0, 0, 0, 0, 0, 0, 0, 0 };
  }

  currentState = WIFI_DOWN;
  handleLEDs();

  if (!WiFi.config(local_IP, gateway, subnet, primaryDNS, secondaryDNS)) {
    Serial.println("STA Failed to configure");
  }

  Serial.println("Initialising...");
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.begin(ssid, pw);
  Serial.println("Connecting...");

  // Don't block forever - loop() has proper reconnect handling.
  uint32_t t0 = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - t0 < 30000) {
    handleLEDs();
    Serial.print(".");
    delay(500);
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nConnected! IP: " + WiFi.localIP().toString());
    syncTime(10000);

    startOTA();
#if ENABLE_FAILOVER_API
    startWeb();
#endif
    doBootReportIfPending();
    currentState = WIFI_CONNECTED_IDLE;
  } else {
    Serial.println("\n[-] Could not join WiFi in 30s, continuing in retry mode.");
  }

  handleLEDs();
  lastHeartbeatMs = millis();
}

void loop() {
  // While an image is streaming in, keep off the network and out of the heap.
  if (otaInProgress) {
    handleLEDs();
    delay(20);
    return;
  }

  handleWiFi();

  if (WiFi.status() == WL_CONNECTED) {
    startOTA();
#if ENABLE_FAILOVER_API
    startWeb();
    handleFailoverPending();
#endif
    doBootReportIfPending();
    flushAlertQueue();
#if ENABLE_TG_COMMANDS
    pollTelegram();
#endif
#if ENABLE_DAILY_DIGEST
    maybeDailyDigest();
#endif

    if (millis() - lastPingTime >= PING_INTERVAL || !firstCycleDone) {
      lastPingTime = millis();
      runCheckCycle();
    }
  }

  heartbeat();
  handleLEDs();
  delay(20);
}
